---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
LinePattern Properties
LinePattern Class See Also Send Feedback
---

The LinePattern type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | Line pattern name. |

# See Also

LinePattern Class

Autodesk.Revit.DB Namespace